#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + project                                   = "tf-shared-vpc-host-78a3"
      + routing_mode                              = "REGIONAL"
      + self_link                                 = (known after apply)
    }

  # module.vpc.google_compute_subnetwork.primary_subnet will be created
  + resource "google_compute_subnetwork" "primary_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.10.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "honestcard-compute-primary-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "tf-shared-vpc-host-78a3"
      + purpose                    = (known after apply)
      + region                     = "asia-southeast2"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "10.20.0.0/16"
              + range_name    = "honestcard-compute-pods-subnet"
            },
          + {
              + ip_cidr_range = "10.30.0.0/16"
              + range_name    = "honestcard-compute-services-subnet"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = "IPV4_ONLY"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + pods_subnet_cidr             = "10.20.0.0/16"
  + pods_subnet_name             = "honestcard-compute-pods-subnet"
  + primary_subnet_ip_cidr_range = "10.10.0.0/16"
  + primary_subnet_name          = "honestcard-compute-primary-subnet"
  + primary_subnet_self_link     = (known after apply)
  + services_subnet_cidr         = "10.30.0.0/16"
  + services_subnet_name         = "honestcard-compute-services-subnet"
  + shared_vpc_id                = (known after apply)
  + shared_vpc_self_link         = (known after apply)
  + vpc_network_id               = (known after apply)
  + vpc_network_name             = "vpc"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*